# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.

# dict
season_dict = {"1": "зима",
               "2": "зима",
               "3": "весна",
               "4": "весна",
               "5": "весна",
               "6": "лето",
               "7": "лето",
               "8": "лето",
               "9": "осень",
               "10": "осень",
               "11": "осень",
               "12": "зима",
               }

mon = input("Введите месяц - от  1 до 12: ")

print("dict")
if mon in season_dict.keys():
    print(f"Этот месяц относится ко времени года - {season_dict[mon]}")
else:
    print("Такого месяца нет")

# list
print("list")
season_list = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
if 1 < int(mon) < 13:
    print(f"Этот месяц относится ко времени года - {season_list[int(mon) - 1 ]}")
else:
    print("Такого месяца нет")
