# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3,
# а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

from itertools import count, cycle

iter_list = []
cnt = 0
el = count(3)
while cnt < 10:
    a = next(el)
    print(a)
    iter_list.append(a)
    cnt += 1

print("********************")

tmp = cycle(iter_list)
cnt1 = 0
while cnt1 < 15:
    print(next(tmp))
    cnt1 += 1
