# 6. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.

a = int(input("Введите a: "))
b = int(input("Введите b: "))

days = 1
km = a
while km < b:
    km += km * 0.1
    days += 1

print(f"На {days}-й день спортсмен достиг результата — не менее {b} км.")
